Revit 2026 API

# AnalyticalEquipmentLoadDataLoadSet Property

---

The electrical analytical load set of the analytical equipment load.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId LoadSet { get; set; }
```
```vb
Public Property LoadSet As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ LoadSet {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member LoadSet : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given element id loadSetId is neither a load set id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

invalidElementId if the analytical equipment load does not belong to any analytical load sets.

#### Reference

AnalyticalEquipmentLoadData Class

Autodesk.Revit.DB.Electrical Namespace